src/Documents/Инвентаризация/Инвентаризация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Инвентаризация</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.Ячейки</types>
      </type>
    </attributes>
    <attributes>
      <name>УчетноеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическоеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Инвентаризация/ManagerModule.bsl
Функция СформироватьАктРасхождения(ОбъектДокумента) Экспорт
    Макет = Документы.Инвентаризация.ПолучитьМакет("АктРасхождения");
    ТабДок = Новый ТабличныйДокумент;

    ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
    ОбластьСтрока = Макет.ПолучитьОбласть("Строка");

    ОбластьШапка.Параметры.Номер = ОбъектДокумента.Номер;
    ОбластьШапка.Параметры.Дата = ОбъектДокумента.Дата;
    ОбластьШапка.Параметры.Склад = ОбъектДокумента.Склад;
    ТабДок.Вывести(ОбластьШапка);

    Для Каждого Строка Из ОбъектДокумента.Товары Цикл
        Отклонение = Строка.ФактическоеКоличество - Строка.УчетноеКоличество;
        Если Отклонение = 0 Тогда
            Продолжить;
        КонецЕсли;

        ОбластьСтрока.Параметры.Заполнить(Строка);
        ОбластьСтрока.Параметры.Отклонение = Отклонение;
        ТабДок.Вывести(ОбластьСтрока);
    КонецЦикла;

    Возврат ТабДок;
КонецФункции
